# age = int(input("Введи возраст: "))
# text = "Привет!"
# text = "Hello!"
# text = 7

# int - целочисленный тип: -1, 0, 5, -101
# float - действительный тип: 0.5, 7.0, 2.1, -2.0, 0.0
# str - строковой тип: "", "4521", '73', "Don't",
# print('Он сказал: "Привет!"')
# bool - логический тип, True, False

# Условный алгоритм
# if age >= 21:
#     print("Проход в клуб и бар!")
# elif age >= 18:
#     print("Проход только в клуб!")
# else:
#     print("Уходи!")
#
# print(type(5))
# print(type(5.0))
# print(type("5.0"))
# print(type(True))
# print(type(5 > 4))

#Алгоритм — это последовательность действий для достижения результата

#Условный алгоритм — это последовательность действий, в которой выполнение тех или иных действий зависит от условий

#Циклический алгоритм — это последовательность действий,
# которые должны повторяться указанное число раз или пока не выполнено заданное условие

#Переменная в программировании — это именованное хранилище данных.
# Его используют для временного хранения значений, которые меняются в программе во время еe работы